var image_list = new Array("image/도서/조윤성 인공지능을 위한 수학.jpg","image/도서/김서현 처음 배우는 암호화.jpg","image/도서/박용재 꿈꾸는 인공지능.jpg","image/도서/박재홍 AI 시대 행복해질 용기.jpg","image/도서/심경은 로봇 시대 인간의 일.jpg","image/도서/신성빈 데이터 분석의 모든 것.jpg","image/도서/이진혁 누가 인공지능을 두려워하나.jpg","image/도서/박충훈 우리에게 IT란 무엇인가.jpg","image/도서/신도윤 비밀의 언어.jpg","image/도서/최영우 한 권으로 읽는 컴퓨터 구조와 프로그래밍.jpg","image/도서/이두진 알고리즘 라이프.jpg")
var text_list = new Array("2124 조윤성\n\n“인공지능을 위한 수학”이라는 책을 읽으며 인공지능과 프로그래밍 분야에 활용되는 수학적 기초를 다짐. NLU와 딥러닝, 이미지 분석 등 AI에 실제로 수학이 사용되는 예시들을 배우고, 그 중 자연어 처리와 관련된 내용을 실제로 어떠한 과정을 거쳐서 활용할 수 있는지를 동아리원들에게 발표하며 앞으로의 계획을 말함. 영어 시간에 인공지능 챗봇과 관련된 내용을 조사하고 발표하면서 자연어 처리 분야에 대해서 추가 조사를 하고 싶다는 계획이 있었는데, 책을 읽으면서 평소 하는 프로그래밍과 멀다고 느낀 구체적인 인공지능 구현에 대해 배울 수 있어서 좋았고, 관심 분야를 발표하면서 관련 내용에 대해서 더 잘 알게 됨. 최근 인공지능 특강을 통해서 파이썬을 통한 인공지능 구현과 Orange3 프로그램을 통한 인공지능 활용에 대해서도 배웠는데, 앞으로도 기초적인 구현과 실질적인 활용을 공부해나가며 인공지능을 필요한 분야에 잘 활용할 수 있는 능력을 기르고 싶음.",
"2302 김서현\n\n‘처음 배우는 암호화’라는 책을 읽고 평소 관심 있던 RSA 암호에 대해 PPT를 만들고 발표했다.  공개키 암호화에 대해 정의할 수 있었고, 케르크호프스의 원리에 대해서도 알 수 있었다. RSA 암호와 양자컴퓨터의 관계를 정립할 수 있었다. 암호와 관련된 책을 읽을 때마다 디피헬먼법이 언급되고 이 책에서도 언급되었었는데, 이게 무엇인지 더 찾아본다.",
"2106 박용재\n\n꿈꾸는 인공지능 이라는 책을 읽고 동아리원들 앞에서 책의 내용과 책을 읽고 나서의 느낀점, 그리고 인공감성 기술과 관련된 게임을 만들고 싶다는 나의 목표를 발표함. 다윈의 생물학적 진화에 기원한 인공생명에 대해서 알 수 있었고, 인공 감성에 대해 읽고 지니, 이루다 등등 대화형 AI와 같은 인공감성 기술을 이용한 게임을 제작하고 싶다고 생각함. 목표로 한 게임 제작을 위해 유니티와 같은 게임 엔진 사용법을 학습하고 게임 제작을 위한 C#과 같은 프로그래밍 언어를 학습할 생각임. 인공지능 구현법에 대해서도 완전히 내것이 되도록 학습하여 컴퓨터와 인공지능 분야와 관련된 전문성을 기르고 싶음.",
"2107 박재홍\n\n위 활동에서 나는 ‘AI 시대 행복해질 용기’라는 책을 읽음. 위의 책을 읽고나서 시대가 빠르게 AI 시대로 변화하는 세상에서 우리는 현재 우리가 컴퓨터와 휴대폰을 일상에서 당연하듯이 사용하는 것처럼 AI도 일상 처럼 받아들여야 한다는 등 어떤 자세를 가져야하는 친구들에게 공유함. 이 책을 읽은 이유는 다시 시작하기 위함이였음. 1학년때 부실했던 동아리 운영과 나태한 자신의 문제점을 발견하였고, 위 책을 읽음으로써 알게된 이 AI시대에 필요한 자세를 가슴에 새겨두고 활동을 해야겠다고 다짐함. 여러 자세가 있었지만 가장 인상깊은 것은 친구들에게 공유한 자세 즉 일상처럼 받아드리는 자세였음. 이 책은 내가 다시 올바른 자세를 마음에 새기고 활동하기 위한 목적으로 읽은 책이였음. 때문에 이 책을 읽으면서 얻은 자세로 활동을 하고 나 자신을 발전 시킬 계획임. 또한 이 시대에 내가 다루고 싶은 기술은 게임분야이지만 혹시 모를 나에게 적절한 기술이 있는지 탐구하기 위해 게임 분야가 아닌 다른 분야의 기술을 탐구할 것임.",
"2212 심경은\n\n‘로봇 시대, 인간의 일’이라는 책을 읽고 책의 내용과 내가 책을 읽고 느낀점을 동아리원들 앞에서 발표하고 내가 중점적으로 읽은 부분에 대해 자료 조사를 해봄. 자동화가 도입 되면서, 로봇이 대중화될 미래를 예측하고 있는 이 시기에 미래에 대한 생각을 꾸준히 구체적으로 할 수 있도록 도와주는 책이라고 생각하고 현재 많은 곳에서 이루어 지고 있는 AI면접에 대해 자료를 조사함. 추가 조사를 한 AI 면접에 대해 탐구하고 모든 것들이 자동화로 탈바꿈 하면서 필요한 법과 체제에 대해 생각하고 문제될 수 있는 부분에 대해 보완점을 조사하고 싶음.",
" 2413 신성빈\n\n‘데이터 분석의 모든 것’이라는 책을 읽고 r언어를 이용한 데이터 분석과 그에 필요한 수학적 지식들을 친구들에게 소개함. r언어는 숙련자가 아닌 이상 사용하는 것이 어려워 수학 1 시간에 조사했던 회귀 분석을 이어서 찾아봄. 회귀분석 예제들의 소스코드를 직접 써보면서 기본적인 작동원리와 컴퓨터 언어의 함수를 공부함. 책에서 탐색적 데이터 분석, 데이터 전처리, 통계 기반 데이터 분석으로 나눠서 설명한 과정을 python 언어로 구현해보고 싶음. 수학시간에 조사했었던 베이즈 정리의 연장선으로 나이브 베이즈에 대해서도 관심을 가지게 됨.",
"2422 이진혁\n\n“누가 인공지능을 두려워하는가?”라는 인공지능에 대한 책을 읽으며 내가 인공지능에 대해 이해가 잘 가지 않는 부분을 인터넷 검색을 통해 찾아보고 인공지능에 있는 윤리적 문제 또는 사람들이 우려하는 점에 대해 생각해보았다. 마지막으로 동아리원들에게 책을 소개하고 느낀점과 새로 알게된 점에 대해 발표하였다. 휴머노이드 로봇들을 보면 느끼듯이 로봇의 발전은 한참 멀었다고만 생각하고 있었다.. 하지만 등장시기와 발전 기간을 생각해보면 정말 비약적으로 발전했다는 것을 깨달았고 우리는 미래에 인공지능을 어떻게 잘 활용할 것인지에 대해 생각할 필요가 있다고 느꼈다. 빠르게 발전하는 인공지능의 변화를 뉴스 등을 통해 찾아보며 지켜볼 것이다. 최근 인공지능이 사람의 일자리를 대체하며 생기는 문제들에 대해서도 어떤 방식으로 보완할 수 있을지 조사하고 생각해볼것이다.",
"1113 박충훈 \n\n김국현 저자의 “우리에게 IT란 무엇인가” 도서를 읽고, 4차산업혁명에서의 IT에 대해 조사함. IT에 대한 정의, 관점, 역사를 알게 되었고, 인상 깊었다. 또 다른 4차산업혁명 관련 자료를 조사할 때 도움이 될 것 같다.",
"1313 신도윤\n\n사이먼 싱의 <비밀의 언어>를 읽고 암호의 원리와 역사적 사실의 작동 원리에 대해 읽었다. 그리고 암호해독 기술이 발전하여 양자컴퓨터를 만들기만 한다면 모든 암호를 풀고, 절대 풀 수 없는 암호가 만들어질텐데, 이런 암호들을 극소수만 사용할 것인지에 대한 의문이 들었다.이 활동을 통해 암호의 원리를 알게되었다. 암호의 원리를 이해하는데 좀 시간이 걸리긴 하였지만 암호의 원리에 대해 알아보니 생각보다 더 흥미로운 주제인 것 같다. 또 암호의 원리를 알아가며 미래의 암호화 기술은 어디까지 발전할 것인지에 대한 궁금증이 생겼고, 이 활동은 정말 좋은 경험이였고, 이 책을 이해하기 위해 노력하여 뿌듯하다.이 책을 통해 알게된 암호의 원리를 바탕으로 미래의 기술을 예측하고 싶다.",
"1325 최영우\n\n한 권으로 읽는 컴퓨터 구조와 프로그래밍 책을 읽었다. 컴퓨터 구조를 알아봤다, 평소에는 컴퓨터 구조에는 관심이 없었지만 이 책을 읽으며 컴퓨터 구조를 알아가는 과정이 흥미롭고 재미있었다. 앞으로는 컴퓨터 구조를 구성하는 구성 물품들에 대한 책을 찾아볼것이다.",
"1414 이두진\n\n알리 알모사위의 <알고리즘 라이프>를 읽고 알고리즘에 대해 학습하게 됨. 이 책을 보고 배운 것과 생각하게 된 점 등으로 보고서를 작성함. 알고리즘의 효율성과 중요성에 대해 알게됨. 실생활에서 활용되는 여러 알고리즘을 보고, 알고리즘이 컴퓨터에서만 사용되는 어려운 개념이 아니라는 것을 알게됨. 이 책을 통해 알고리즘에 대해 심화적으로 탐구해 보고 싶다. 알고리즘 문제 풀이를 할 계획이다.")

function bookZoomIn(event, n) {
    event.target.style.zIndex = 1;
    event.target.style.transform = "scale(1.2)";
    event.target.style.transition = "all 0.5s";
    event.target.style.animation = "fadeout_s 0.5s";
    event.target.style.opacity = "0.5";
  }
  
function bookZoomOut(event) {
    event.target.style.zIndex = 0;
    event.target.style.opacity = "1";
    event.target.style.transform = "scale(1)";
    event.target.style.transition = "all 0.5s";
    event.target.style.animation = "fadein_s 0.5s";
}

function BookClickOn(event, n){
    document.getElementById("Book_img").src=image_list[n];
    document.getElementById("Book_Text").innerText=text_list[n];
    var modal=document.getElementsByClassName("Book_Modal");
    for(var i=0; i<modal.length; i++){
        modal[i].style.animation="fadein 0.3s";
        modal[i].style.display="block";
    }
}

function BookClickOff(event){
    var modal=document.getElementsByClassName("Book_Modal");
    for(var i=0; i<modal.length; i++){
        modal[i].style.display="none";
    }
}